# Install command-line tools using homebrew
# Usage: `brew bundle Brewfile`
# Create new one from installed brew packages: `brew bundle dump`

# what's on tap?
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/completions'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'homebrew/versions'
tap 'phinze/cask'
brew 'cask'

# the essentials
brew 'macvim', args: ['override-system-vim']
brew 'tmux'

# languages
brew 'node'
brew 'n'
brew 'yarn'
brew 'postgresql'
brew 'mysql'
brew 'mongodb'
brew 'nginx'

# helpful command line tools
brew 'the_silver_searcher'
brew 'ssh-copy-id'
brew 'wget'
brew 'fzf'

# media manipulation
brew 'imagemagick'
brew 'ffmpeg'

# applications

## core
cask_args appdir: '/Applications'
cask 'google-chrome'
cask 'iterm2'
cask 'macvim'
cask 'spectacle'
cask 'hammerspoon'
cask 'spotify'
cask 'dropbox'

## utils
cask 'caffeine'
cask 'appcleaner'
cask 'imageoptim'
cask 'disk-inventory-x'
cask 'the-unarchiver'

## extra
cask 'aseprite'
cask 'bfxr'
cask 'steam'
cask 'sketch'
cask 'visual-studio-code'
cask 'firefox'

# quick look enhancements
cask 'qlimagesize'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'webp-quicklook'
