# Install command-line tools using homebrew
# Usage: `brew bundle Brewfile`
# Create new one from installed brew packages: `brew bundle dump`

# what's on tap?
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/completions'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'homebrew/versions'
tap 'phinze/cask'
brew 'cask'

# the essentials
brew 'macvim', args: ['override-system-vim']
brew 'tmux'

# language upgrades
brew 'node'
brew 'ruby'
brew 'python'

# web
brew 'postgresql'
brew 'mysql'
brew 'mongodb'
brew 'nginx'

# helpful command line tools
brew 'reattach-to-user-namespace'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'wget'
brew 'fzf'

# media manipulation
brew 'imagemagick'
brew 'ffmpeg'

# quick look enhancements
cask 'betterzipql'
cask 'qlimagesize'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'webp-quicklook'

